# Pandas Basic

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\tip-crb-08\anaconda3\lib\site-packages (1.3.4)
Requirement already satisfied: numpy>=1.17.3 in c:\users\tip-crb-08\anaconda3\lib\site-packages (from pandas) (1.20.3)
Requirement already satisfied: pytz>=2017.3 in c:\users\tip-crb-08\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\tip-crb-08\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\tip-crb-08\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [2]:
import numpy as np
import pandas as pd

In [3]:
pd.Series([4.5, 3.0, 2.1])
#kolom kiri adalah value yg dimasukkan
#kolom kanan adalah identifier atau index
#dtype adalah data type dari value yg dimasukkan

0    4.5
1    3.0
2    2.1
dtype: float64

In [5]:
pd.Series(['a','b',4])
#tipe data object makan data lebih besar

0    a
1    b
2    4
dtype: object

In [7]:
revenues = pd.Series([5555,7000,1980])

In [8]:
revenues

0    5555
1    7000
2    1980
dtype: int64

In [9]:
revenues.values

array([5555, 7000, 1980], dtype=int64)

In [10]:
revenues.index

RangeIndex(start=0, stop=3, step=1)

In [11]:
#mengganti index dengan label yg kita berikan
city_revenues = pd.Series(
    [4200, 8000, 6500],
    index=["Amsterdam", "Toronto", "Tokyo"]
)
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [12]:
#membuat series dengan dictionary {}
city_employee_count = pd.Series({"Amsterdam": 5, "Tokyo": 8})
city_employee_count

Amsterdam    5
Tokyo        8
dtype: int64

In [13]:
city_employee_count.keys()

Index(['Amsterdam', 'Tokyo'], dtype='object')

In [14]:
"Tokyo" in city_employee_count

True

In [15]:
"Tkyo" in city_employee_count

False

In [16]:
5 in city_employee_count
#cuma bisa dicek yg index aja

False

In [18]:
city = pd.Series({1: 5, 2: 8})
city

1    5
2    8
dtype: int64

In [22]:
5 in city

False

In [24]:
8 in city_employee_count.values

True

In [ ]:
#pd.DataFrame({
#    "nama kolom 1" : value kolom 1,
#    "nama kolom 2": value di kolom 2

#})

In [25]:
city_data = pd.DataFrame({
    "revenue": city_revenues,
    "employee_count": city_employee_count
})

In [26]:
city_data
#Nan = Not a Number atau dikenal sbg missing value

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [28]:
city_data.info()
#untuk cek info tipe dadta tiap kolom
#int akan berubah float ktk ada Nan

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Amsterdam to Toronto
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   revenue         3 non-null      int64
 1   employee_count  2 non-null      float64
dtypes: float64(1), int64(1)
memory usage: 72.0+ bytes

In [ ]:
#dalam data frame ada 3 komponen: kolom, label, value

In [29]:
city_data.index

Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object')

In [30]:
city_data.values
#pasti akan jadi scientific numbers

array([[4.2e+03, 5.0e+00],
       [6.5e+03, 8.0e+00],
       [8.0e+03,     nan]])

In [32]:
city_data.columns
#ngecek kolom yg tersedia

Index(['revenue', 'employee_count'], dtype='object')

In [33]:
city_data.axes
#axis 0 adalah barisnya (index)
#axis 1 adalah kolom

[Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object'),
 Index(['revenue', 'employee_count'], dtype='object')]

In [35]:
city_data.axes[0]

Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object')

In [36]:
city_data.axes[1]

Index(['revenue', 'employee_count'], dtype='object')

In [37]:
city_data.keys() #yg keluar nama kolom

Index(['revenue', 'employee_count'], dtype='object')

In [38]:
"Amsterdam" in city_data #gada karna dia di index

False

In [40]:
"revenue" in city_data #karna dia di kolom

True

## akses elemen di series

In [41]:
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [ ]:
#.loc akses elemennya berdasarkan label
#.iloc aksesnya berdasarkan index default python (0,1,..)

In [42]:
city_revenues["Toronto"] #cara biasa akses elemen

8000

In [43]:
city_revenues[1] #cara akses dengan index default

8000

In [46]:
city_revenues[-3]

4200

In [47]:
city_revenues[1:]

Toronto    8000
Tokyo      6500
dtype: int64

In [48]:
colors = pd.Series(
    ["red", "purple", "blue", "green", "yellow"],
    index=[1, 2, 3, 5, 8]
)
colors

1       red
2    purple
3      blue
5     green
8    yellow
dtype: object

In [49]:
colors.loc[1]

'red'

In [50]:
colors.iloc[1]

'purple'

In [51]:
#bisa slicing dengan loc iloc
colors.iloc[1:3]

2    purple
3      blue
dtype: object

In [55]:
colors.loc[1:3] #ambil elemen/value berdasarkan label

1       red
2    purple
3      blue
dtype: object

In [56]:
colors.iloc[[0,3]] #ambil index ke 0 dengan step 3

1      red
5    green
dtype: object

In [57]:
colors

1       red
2    purple
3      blue
5     green
8    yellow
dtype: object

In [58]:
colors.loc[3:8] #kalo loc yg akhirnya ikut jadi dari 3 sampe 8
#sedangkan kalo iloc 3:8 dibacanya dari 3 sampe sebelum 8

3      blue
5     green
8    yellow
dtype: object

In [60]:
colors.loc[[1,3,8]]

1       red
3      blue
8    yellow
dtype: object

In [61]:
colors.loc[1:8:2]

1       red
3      blue
8    yellow
dtype: object

In [62]:
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [63]:
city_revenues.loc['Toronto':]

Toronto    8000
Tokyo      6500
dtype: int64

In [65]:
city_revenues.loc['Amsterdam':'Tokyo':2]

Amsterdam    4200
Tokyo        6500
dtype: int64

## Akses elemen di DataFrame

In [66]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [67]:
city_data["revenue"] #terpanggil dalam bentuk list

Amsterdam    4200
Tokyo        6500
Toronto      8000
Name: revenue, dtype: int64

In [68]:
city_data.revenue 
#gabisa pake ini kalo nama kolomnya sama dg atribut di dataframe

Amsterdam    4200
Tokyo        6500
Toronto      8000
Name: revenue, dtype: int64

In [69]:
city_data.shape

(3, 2)

In [70]:
city_data[['revenue','employee_count']]

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [71]:
city_data.loc["Amsterdam"]

revenue           4200.0
employee_count       5.0
Name: Amsterdam, dtype: float64

In [72]:
city_data.loc['Tokyo':'Toronto']

         revenue  employee_count
Tokyo       6500             8.0
Toronto     8000             NaN

In [73]:
city_data.iloc[1]

revenue           6500.0
employee_count       8.0
Name: Tokyo, dtype: float64

In [74]:
city_data.loc['Tokyo':'Toronto', :]

         revenue  employee_count
Tokyo       6500             8.0
Toronto     8000             NaN

In [75]:
city_data.loc['Amsterdam':'Tokyo', 'revenue']

Amsterdam    4200
Tokyo        6500
Name: revenue, dtype: int64

In [77]:
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [76]:
city_revenues.sum()

18700

In [83]:
city_revenues.mean() #ada min, max, median

6233.333333333333

## gabungkan beberapa dataframe

In [85]:
further_city_data = pd.DataFrame(
    {"revenue": [7000, 3400], "employee_count": [2, 2]},
    index=["New York", "Barcelona"]
)
further_city_data

           revenue  employee_count
New York      7000               2
Barcelona     3400               2

In [86]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [87]:
#gabungkan city_data dengann further_city_data secara vertikal
all_city_data = pd.concat([city_data,further_city_data], sort = False)
all_city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN
New York      7000             2.0
Barcelona     3400             2.0

In [88]:
#Horizontal
city_countries = pd.DataFrame({
    "country": ["Holland", "Japan", "Holland", "Canada", "Spain"],
    "capital": [1, 1, 0, 0, 0]},
    index=["Amsterdam", "Tokyo", "Rotterdam", "Toronto", "Barcelona"]
)
city_countries

           country  capital
Amsterdam  Holland        1
Tokyo        Japan        1
Rotterdam  Holland        0
Toronto     Canada        0
Barcelona    Spain        0

In [94]:
cities = pd.concat([all_city_data,city_countries],axis=1,sort=False)
cities
#kalo pake true jadinya sort by abjad a-z
#kalo false jadinya sesuai urutan data sebelumnya

           revenue  employee_count  country  capital
Amsterdam   4200.0             5.0  Holland      1.0
Tokyo       6500.0             8.0    Japan      1.0
Toronto     8000.0             NaN   Canada      0.0
New York    7000.0             2.0      NaN      NaN
Barcelona   3400.0             2.0    Spain      0.0
Rotterdam      NaN             NaN  Holland      0.0

https://pandas.pydata.org/docs/reference/api/pandas.concat.html
pandas documentation
search pd.concat in google

In [95]:
pd.concat([all_city_data,city_countries],axis=1,join="inner")
#join="inner" semacam irisan dari 2 data frame
#join="outer" penggabungan 2 dataframe

           revenue  employee_count  country  capital
Amsterdam     4200             5.0  Holland        1
Tokyo         6500             8.0    Japan        1
Toronto       8000             NaN   Canada        0
Barcelona     3400             2.0    Spain        0

concat : acuan 2 dataframe berdasarkan index...
merge : berdasarkan kolom

In [96]:
countries = pd.DataFrame({
    "population_millions": [17, 127, 37],
    "continent": ["Europe", "Asia", "North America"]
}, index=["Holland", "Japan", "Canada"])
countries

         population_millions      continent
Holland                   17         Europe
Japan                    127           Asia
Canada                    37  North America

In [97]:
cities

           revenue  employee_count  country  capital
Amsterdam   4200.0             5.0  Holland      1.0
Tokyo       6500.0             8.0    Japan      1.0
Toronto     8000.0             NaN   Canada      0.0
New York    7000.0             2.0      NaN      NaN
Barcelona   3400.0             2.0    Spain      0.0
Rotterdam      NaN             NaN  Holland      0.0

In [98]:
#merge hanya bisa horizontal
#acuannya kolom country
pd.merge(cities, countries, left_on="country",right_index=True)

,revenue,employee_count,country,capital,population_millions,continent
Amsterdam,4200.0,5.0,Holland,1.0,17,Europe
Rotterdam,NaN,NaN,Holland,0.0,17,Europe
Tokyo,6500.0,8.0,Japan,1.0,127,Asia
Toronto,8000.0,NaN,Canada,0.0,37,North America

In [99]:
pd.merge(
    cities,
    countries,
    left_on="country",
    right_index=True,
    how="left"
)

,revenue,employee_count,country,capital,population_millions,continent
Amsterdam,4200.0,5.0,Holland,1.0,17.0,Europe
Tokyo,6500.0,8.0,Japan,1.0,127.0,Asia
Toronto,8000.0,NaN,Canada,0.0,37.0,North America
New York,7000.0,2.0,NaN,NaN,NaN,NaN
Barcelona,3400.0,2.0,Spain,0.0,NaN,NaN
Rotterdam,NaN,NaN,Holland,0.0,17.0,Europe